ws-parent/ws-interface/src/main/webapp/wsdl/ClimatService.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	targetNamespace="/ClimatService" xmlns:tns="/ClimatService" xmlns:xsd1="/entities/climat"
	xmlns:flt="http://nl.hu.fnt.gsos/ClimatService/fault" name="ClimatService">
	<wsdl:types>
		<xsd:schema targetNamespace="xsd1">
			<xsd:import namespace="/entities/climat" schemaLocation="climat.xsd"></xsd:import>
		</xsd:schema>
		<xsd:schema targetNamespace="flt">
			<xsd:import namespace="http://nl.hu.fnt.gsos/ClimatService/fault" schemaLocation="fault.xsd"></xsd:import>
		</xsd:schema>
    </wsdl:types>

	<wsdl:message name="ClimatRequest">
		<wsdl:part name="getLatRequest" element="xsd1:RequestClimat"></wsdl:part>
	</wsdl:message>

	<wsdl:message name="ClimatResponse">
		<wsdl:part name="getLatResp" element="xsd1:ResponseClimat"></wsdl:part>
	</wsdl:message>

	<wsdl:message name="inputfault">
		<wsdl:part name="fault" element="flt:fault"></wsdl:part>
	</wsdl:message>

	<wsdl:portType name="ClimatServiceInterface">
		<wsdl:operation name="getClimatInfo">
			<wsdl:input message="tns:ClimatRequest"></wsdl:input>
			<wsdl:output message="tns:ClimatResponse"></wsdl:output>
			<wsdl:fault name="fault" message="tns:inputfault"></wsdl:fault>
        </wsdl:operation>
	</wsdl:portType>

	<wsdl:binding name="ClimatServiceBinding" type="tns:ClimatServiceInterface">
		<soap:binding style="document"
			transport="http://schemas.xmlsoap.org/soap/http" />
		<wsdl:operation name="getClimatInfo">
			<soap:operation soapAction="" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
			<wsdl:fault name="fault">
				<soap:fault name="fault" use="literal"/>
			</wsdl:fault>
		</wsdl:operation>
	</wsdl:binding>

	<wsdl:service name="ClimatService">
		<wsdl:port name="ClimatServicePort" binding="tns:ClimatServiceBinding">
			<soap:address location="http://localhost:8009/ws%2Dproducer/ws-producer"></soap:address>
		</wsdl:port>
	</wsdl:service>

</wsdl:definitions>